Revit 2027 API
PartMakerMethodToDivideVolumes.DivisionGap Property
 The gap which is created between matching profiles of parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DivisionGap { get; set; }
Public Property DivisionGap As Double
	Get
	Set
public:
property double DivisionGap {
	double get ();
	void set (double value);
}
member DivisionGap : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for divisionGap must be between 0 and 30000 feet.
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace